export default {
  state: {
    swiperText: [
      {
        title: "We Can Do It",
        text: "안녕하세요. 방문해 주셔서 감사합니다.",
        text2: "웹퍼블리셔 백승인입니다.",
        text3: "나아가 프론트엔드 개발자가 되고싶습니다.",
      },
      {
        title: "Good Web?",
        text: "사용자 어느 누구도 차별하지 않고 사용하기 편리한 웹으로",
        text2: "웹 접근성이 좋은 웹이라 생각합니다.",
        text3: "웹접근성이 뛰어난 웹사이트들을 만들고 싶습니다.",
      },
      {
        title: "프론트엔드 개발자가 되고싶은 이유?",
        text: "처음에는 웹퍼블리셔가 되고싶었습니다.",
        text2:
          "하지만, 공부하다보니 프론트엔드 개발자가 되고싶다는 욕심이 생기게 되었고",
        text3: "현재는 vue를 공부하고 있습니다.",
        text4: "아직은 프론트엔드 개발자가 되기위해 부족한 점이 많습니다.",
        text5: "그래서 웹퍼블리셔로 경험을 쌓고 싶습니다.",
      },
    ],
  },
  mutations: {
  },
  actions: {
  },
  modules: {
  }
}