export default {
  state: {
    // work_main_title
    work_main: [
      {
        id: 1,
        text_content_01:
          `
          기존의 한솥 사이트는 심플하면서 뛰어난 가독성과 사용자가 이용하는데 피로함이 적다는 것이 장점이 있습니다.
          해외사이트처럼 다양한 효과를 사용하지는 않았지만 최소한의 효과로 가독성을 높이고 장정돈 되어 있는 레이아웃으로 보기 편한 사이트라 생각합니다.
          `,
        text_content_02:
          `
          첫 클론코딩으로 아쉬운 점이 많았던 것 같습니다.
          1. 이미지에 대한 적용문제
          2. 슬라이드에 대한문제
          이 두가지 문제가 가장 아쉬운 문제로 이미지가 일그러지는 문제와
          슬라이드에대한 이해가 부족했던 점에 아쉬움이 남았던 작업이였습니다.
          `
      },
      {
        id: 2,
        text_content_01:
          `
          기존 이케아의 장점은 햄버거 메뉴기능이 다단으로 구현되어 찾고자하는 정보를 쉽게 접할 수 있는 것이라 생각합니다.
          그 장점을 구현하되 저만의 방식으로 리뉴얼을 해보았습니다.
          `,
        text_content_02:
          `
          메인 비쥬얼 영역을 갤러리형식으로 제작하여 이케아의 제품을 활용한 디지털쇼룸을 돋보이게 하는 것이 목적이며,
          이미지가 넘어가는 것에 매끄럽지 못한 것에 대한 아쉬움과 디테일이 많이 부족하다는 느낌이 많이 아쉬웠습니다.
          `
      },
      {
        id: 3,
        text_content_01:
          `
          렛츠코레일은 여행검색 및 예약 기능이 잘 구현되어 있는 웹사이트 입니다. 그 기능을 제작해보고 싶었습니다.
          기존 렛츠코레일의 경우 네이버와 같은 검색 사이트와 동일하게 반응형웹으로 제작되지 않았지만,
          이번에 포트폴리오용으로 반응형웹으로 제작 해보았습니다.
          `,
        text_content_02:
          `
          form을 활용한 요소들의 활용에 아쉬움이 많으며, form요소의 css적용에 대한 문제가 많이 아쉽습니다.
          `
      },
      {
        id: 4,
        text_content_01:
          `
          Vue로 제작한 첫번쨰 포트폴리오 페이지로 심플하지만 제작물들을 보기 편하게 모아둔 웹사이트입니다.
          `,
        text_content_02:
          `
          Vue를 활용한 첫 페이지라 많은 아쉬움이 남지만 그중 하나가 제작시간이 생각했던 것 보다 더 걸렸다는 것입니다.
          하지만, 포트폴리오를 제작함으로써 Vue를 이해하는 한편, 기초를 다지는데 도움이 되었습니다.
          `
      },
    ],

    // work_main_title end
  },
  mutations: {
  },
  actions: {
  },
  modules: {
  }
}